---
title: The complete nose to tail
author: Fergus Henderson
publisher: Bloomsbury
year: 2012
kitchen: english
book_url: https://stjohnrestaurant.com/products/book-example
link: St. John
index: 11
text: "Fergus' iconic book. 'It would be disingenuous to the animal not to make the most of the whole beast; there is a set of delights, textural and flavoursome, which lie beyond the fillet.' Thus Fergus Henderson set out his stall when he opened St. John in 1995, now one of the world's most admired restaurants. His Nose to Tail books are full of exhilarating recipes for dishes that combine high sophistication with peasant thriftiness. Now the books are joined together in a compendious volume, The Complete Nose to Tail, with additional new recipes and more brilliant photography from Jason Lowe. This collection of recipes includes traditional favourites like Eccles cakes, devilled kidneys, and seed cake with a glass of Madeira, as well as many St. JOHN classics for more adventurous gastronomes - Roast Bone Marrow and Parsley Salad, Deep Fried Tripe and Pot Roast Half Pig's Head to name but a few. With a dozen new recipes on top of 250 existing ones, more than 100 quirky photos and exceptional production values, The Complete Nose to Tail is not only comprehensive but extremely desirable."
---

Fergus' iconic book. "It would be disingenuous to the animal not to make the most of the whole beast; there is a set of delights, textural and flavoursome, which lie beyond the fillet."

Thus Fergus Henderson set out his stall when he opened St. John in 1995, now one of the world's most admired restaurants. His Nose to Tail books are full of exhilarating recipes for dishes that combine high sophistication with peasant thriftiness. Now the books are joined together in a compendious volume, The Complete Nose to Tail, with additional new recipes and more brilliant photography from Jason Lowe. This collection of recipes includes traditional favourites like Eccles cakes, devilled kidneys, and seed cake with a glass of Madeira, as well as many St. JOHN classics for more adventurous gastronomes - Roast Bone Marrow and Parsley Salad, Deep Fried Tripe and Pot Roast Half Pig's Head to name but a few.

With a dozen new recipes on top of 250 existing ones, more than 100 quirky photos and exceptional production values, The Complete Nose to Tail is not only comprehensive but extremely desirable.